# GUID Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..GUID Property
Parameter Class See Also
---
The Guid for a shared parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Guid GUID { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GUID As Guid
	Get
```

Visual C++
---
```text
public:
property Guid GUID {
	Guid get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the parameter is not a shared parameter. |

# See Also
Parameter Class
Autodesk.Revit.DB Namespace